
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СозданоИзФормыОбъекта") Тогда
		
		Элементы.ТипОбъекта.ТолькоПросмотр = Истина;
		Элементы.ИмяОбъекта.ТолькоПросмотр = Истина;
		
		Объект.ТипОбъекта = ?("Документ" = Параметры.ТипДокумента, 
		Перечисления.Д_ТипыОбъектов.Документ, Перечисления.Д_ТипыОбъектов.Справочник);
		
		Объект.ИмяОбъекта = Параметры.ИмяДокумента;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыеЗапросыЗапросПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИспользуемыеЗапросы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Запрос) Тогда
		ИдентификаторДляФормулы = СтрШаблон("%1%2", ПолучитьТипЗапроса(ТекущиеДанные.Запрос), ТекущиеДанные.НомерСтроки);
		ТекущиеДанные.ИдентификаторДляФормулы = ИдентификаторДляФормулы;
	КонецЕсли;
	
	ОбновитьСписокДоступныхЗапросов();
	
КонецПроцедуры
          
&НаСервере
Процедура ОбновитьСписокДоступныхЗапросов()
	
	ВариантыПеременных.Очистить();
	
	Для каждого Строка Из Объект.ИспользуемыеЗапросы Цикл
		ВариантыПеременных.Добавить(Строка.ИдентификаторДляФормулы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьСписокДоступныхЗапросов();
КонецПроцедуры

&НаСервере
Функция ПолучитьТипЗапроса(ЗапросСсылка) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Д_НастройкиШаблоновОтправки.ТипЗапроса КАК ТипЗапроса
	|ИЗ
	|	Справочник.Д_НастройкиШаблоновОтправки КАК Д_НастройкиШаблоновОтправки
	|ГДЕ
	|	Д_НастройкиШаблоновОтправки.Ссылка = &ЗапросСсылка";
	
	Запрос.УстановитьПараметр("ЗапросСсылка", ЗапросСсылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат Строка(РезультатЗапроса.ТипЗапроса);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СтрШаблон("НастройкиПорядкаВыполнения_%1", Объект.ИмяОбъекта);
КонецПроцедуры
