Процедура УдалитьФайлыКлиентСервер(Файл) Экспорт
	
	#Если Клиент Тогда
		ОО = Новый ОписаниеОповещения("ЗавершениеУдалениеФайлов", ЭтотОбъект);
		НачатьУдалениеФайлов(ОО, Файл);
	#Иначе
		УдалитьФайлы(Файл);
	#КонецЕсли
	
КонецПроцедуры   

Функция ОкруглитьДоСотых(ВхЧисло) Экспорт
	Возврат ВхЧисло - (ВхЧисло % 100);
КонецФункции

Процедура ЗавершениеПомещениеФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		Д_ИнтеграцияСJiraВызовСервера.АнализФайлаОтвета(Адрес, Неопределено, ДополнительныеПараметры.КодСостояния);	
	КонецЕсли;
	
КонецПроцедуры

Процедура АнализФайлаОтвета(ФайлОтвет, КодСостояния) Экспорт
	
	#Если Клиент Тогда
		ДД = Новый Структура("КодСостояния", КодСостояния);
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗавершениеПомещениеФайла", ЭтотОбъект, ДД), "", ФайлОтвет, Ложь, Новый УникальныйИдентификатор());
	#Иначе
		Д_ИнтеграцияСJiraВызовСервера.АнализФайлаОтвета(Неопределено, ФайлОтвет, КодСостояния);
	#КонецЕсли
	
КонецПроцедуры