Функция ПолучитьЗаголовки() Экспорт
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-type", "application/json");
	Возврат Заголовки;
	
КонецФункции  

Функция Авторизоваться() Экспорт
	
	ЗначенияРеквизитов = Новый Структура();
	ЗначенияРеквизитов.Вставить("ИспользуемыйЛогинJira", "Пользователь");
	ЗначенияРеквизитов.Вставить("ИспользуемыйПарольJira", "Пароль");
	
	ДанныеАвторизации = Д_ОбщегоНазначенияКлиентСервер.ЗначенияПредопределенныхПараметров(ЗначенияРеквизитов);
	Если НЕ ЗначениеЗаполнено(ДанныеАвторизации.Пользователь) ИЛИ НЕ ЗначениеЗаполнено(ДанныеАвторизации.Пароль) Тогда
		ВызватьИсключение "При авторизации произошли ошибки";	
	КонецЕсли;
		
	СтруктураТела = Новый Структура("username, password", ДанныеАвторизации.Пользователь, ДанныеАвторизации.Пароль);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураТела);           
	ДанныеJSON = ЗаписьJSON.Закрыть();
	
	JIRA_URL = Д_ОбщегоНазначенияВызовСервера.ЗначениеПредопределенногоПараметра("ШаблонАдресаJira");
	URL = СтрШаблон("%1/rest/auth/1/session", JIRA_URL.ШаблонАдресаJira);
	Ответ = Д_ИнтеграцияСJiraВызовСервера.ВыполнитьPOSTЗапрос(URL, ДанныеJSON, Истина);
	
	Куки = Ответ.Заголовки["Set-Cookie"];
	Д_ОбщегоНазначенияВызовСервера.ЗаписатьЗначениеПараметра("СтрокаCookieJira", Куки);
	
	Возврат Куки;
	
КонецФункции
