
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда	
		НаименованиеСправочника = "СопоставлениеПолейЗапроса" + Строка(Параметры.ИмяОбъекта) + Строка(Параметры.ТипЗапроса);
		Объект.Наименование = НаименованиеСправочника;
		
		Объект.GUIDЗаписи = Параметры.UIDЗаписи;
		ИмяОбъекта = Строка(Параметры.ТипОбъекта) + "." + Строка(Параметры.ИмяОбъекта);
		
		ЗаполнитьТаблицуПараметрами(Параметры.ШаблонJSON);
	КонецЕсли;
	Если Параметры.Свойство("ПроизвольныйЗапрос") Тогда
		
		Элементы.СопоставленныеПараметрыСопоставленноеЗначение.РежимВыбораИзСписка = Параметры.ПроизвольныйЗапрос;
		ИмяОбъекта = Строка(Параметры.ТипОбъекта) + "." + Строка(Параметры.ИмяОбъекта);
		ЗаполнитьСписокВыбораРеквизитов(ИмяОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораРеквизитов(ИмяОбъекта)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	
	Для каждого Элемент Из ОбъектМетаданных.Реквизиты Цикл
		
		Элементы.СопоставленныеПараметрыСопоставленноеЗначение.СписокВыбора.Добавить(Элемент.Имя);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПараметрами(ШаблонJSON)
	
	КоличествоСтрок = Д_ИнтеграцияСJiraВызовСервера.ПолучитьКоличествоПараметровДляСопоставления(ШаблонJSON);
	
	Для Счетчик = 1 По КоличествоСтрок Цикл
		
		ИмяПараметра = "#Параметр" + Строка(Счетчик) + "#";
		
		НоваяСтрока = Объект.СопоставленныеПараметры.Добавить();
		НоваяСтрока.Параметр = ИмяПараметра;
		
	КонецЦикла;
	
КонецПроцедуры
