Процедура ВыполнитьКоманду(Команда, Форма, Источник) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Команда", Команда);
	Параметры.Вставить("Форма", Форма);
	Параметры.Вставить("Источник", Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьКомандуЗавершение",
	ЭтотОбъект, Параметры);
	
	Если Команда.Имя = "Подключаемый_СоздатьШаблонИнтеграцииJira" Тогда
		ТекстВопроса = "Открыть форму создания шаблона интеграции?";	
	ИначеЕсли Команда.Имя = "Подключаемый_ОткрытьСписокШаблонов" Тогда
		ТекстВопроса = "Открыть список шаблонов объекта?";	
	ИначеЕсли Команда.Имя = "Подключаемый_НастроитьВыполнениеЗапросов" Тогда
	    ТекстВопроса = "Открыть форму настройки запросов?";
	КонецЕсли; 
							
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);				
						
КонецПроцедуры

Процедура ВыполнитьКомандуЗавершение(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	Форма = Параметры.Форма;
	Команда = Параметры.Команда;
	Источник = Параметры.Источник;
	
	СтруктураМетаданных = Д_ИнтеграцияСJiraВызовСервера.ПолучитьСтруктуруМетаданных(Источник.Ссылка);
	
	ПараметрыОткрытия = Новый Структура();
	
	Если Команда.Имя = "Подключаемый_СоздатьШаблонИнтеграцииJira" Тогда
		
		ПараметрыОткрытия.Вставить("СозданоИзФормыОбъекта", Истина);
		ПараметрыОткрытия.Вставить("ТипДокумента", СтруктураМетаданных.ТипДокумента);
		ПараметрыОткрытия.Вставить("ИмяДокумента", СтруктураМетаданных.ИмяДокумента);
		ОткрытьФорму("Справочник.Д_НастройкиШаблоновОтправки.Форма.ФормаЭлемента", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли Команда.Имя = "Подключаемый_ОткрытьСписокШаблонов" Тогда
		
		ЗначенияОтбора = Новый Структура("ТипОбъект,ИмяОбъекта", СтруктураМетаданных.ТипДокумента, СтруктураМетаданных.ИмяДокумента);
		ПараметрыОткрытия = Новый Структура("Отбор", ЗначенияОтбора);
		ОткрытьФорму("Справочник.Д_НастройкиШаблоновОтправки.Форма.ФормаСписка", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли Команда.Имя = "Подключаемый_НастроитьВыполнениеЗапросов" Тогда
		
		ПараметрыОткрытия.Вставить("СозданоИзФормыОбъекта", Истина);
		ПараметрыОткрытия.Вставить("ТипДокумента", СтруктураМетаданных.ТипДокумента);
		ПараметрыОткрытия.Вставить("ИмяДокумента", СтруктураМетаданных.ИмяДокумента);
		ОткрытьФорму("Справочник.Д_НастройкиПорядкаВыполнения.Форма.ФормаЭлемента", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры