Процедура ВыполнитьКоманду(Команда, Форма, Источник) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Команда", Команда);
	Параметры.Вставить("Форма", Форма);
	Параметры.Вставить("Источник", Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьКомандуЗавершение",
						ЭтотОбъект, Параметры);
						
	ТекстВопроса = ?(Команда.Имя = "Подключаемый_СоздатьШаблонИнтеграцииJira",
			"Открыть форму создания шаблона интеграции?", "Открыть список шаблонов объекта?");					
						
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);				
						
КонецПроцедуры

Процедура ВыполнитьКомандуЗавершение(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;
	
	Форма = Параметры.Форма;
	Команда = Параметры.Команда;
	Источник = Параметры.Источник;
	
	СтруктураМетаданных = Д_ИнтеграцияСJiraВызовСервера.ПолучитьСтруктуруМетаданных(Источник.Ссылка);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СозданоИзФормыОбъекта", Истина);
	ПараметрыОткрытия.Вставить("ТипДокумента", СтруктураМетаданных.ТипДокумента);
	ПараметрыОткрытия.Вставить("ИмяДокумента", СтруктураМетаданных.ИмяДокумента);
	
	Если Команда.Имя = "Подключаемый_СоздатьШаблонИнтеграцииJira" Тогда
		ОткрытьФорму("РегистрСведений.Д_НастройкиШаблоновОтправки.Форма.ФормаЗаписи", ПараметрыОткрытия);
	Иначе
		// TODO: Сделать открытие формы списка с отбором.
	КонецЕсли;
	
КонецПроцедуры